{"id":"dynamics-research-corp-2005-2008","organization":"Dynamics Research Corporation (acquired by Engility Corporation)","title":"Software Developer III","employment_type":"full_time","start_date":"2005-05","end_date":"2008-05","location":null,"summary":"DBA and application maintenance for USAF; modernization work, data interfaces, and SQL Server administration.","responsibilities":["Migrated an ASP Classic application to ASP.NET; also completed a rewrite using ASP.NET 2.0 features (including custom/user controls) and built a 508 accessibility interface using ASP.NET 2.0 profile features.","Built an ASP.NET + T-SQL web-based data interface between Oracle scheduling and the SQL Server database feeding a simulation model; included tools/reports for exceptions and interface scenarios.","Modernized ASP Classic UI using CSS and web standards to reduce HTML size/complexity and improve maintainability (using CMMI repeatable processes).","Provided ongoing DTS troubleshooting support for monthly data warehouse updates; upgraded import packages from DTS to SSIS.","Implemented new metrics/levels of detail in MERLIN; refactored T-SQL queries to reduce lines of code ~5× for Weapon System Availability tasking.","Automated SQL Server backups/admin scripts; implemented monitoring/notification for data warehouse health.","Installed/configured a SharePoint issue tracker for a geographically distributed dev team; used in live production.","Built prototype Analysis Services cubes and MDX proof-of-concept for high-performance BI querying.","Collaborated to repair/stabilize VSS repositories and prevent loss of historical source code; set up Subversion for migration.","Created developer documentation: data dictionary, API documentation, and comprehensive web-based user documentation for a data interface tool."],"technologies":["Microsoft SQL Server","SSIS","DTS","SSRS","SSMS","C#","VB.NET","ASP Classic","VB6","Visual Source Safe","Subversion","Visual Studio","SharePoint","MDX"],"links":[],"featured":false,"related_project_slugs":[],"_links":[{"rel":"self","href":"/apis/experience/by-id/dynamics-research-corp-2005-2008.json","type":"application/json"},{"rel":"collection","href":"/apis/experience/index.json","type":"application/json"},{"rel":"first","href":"/apis/experience/pages/1.json","type":"application/json"},{"rel":"describedby","href":"/apis/openapi.yaml","type":"text/yaml"}],"_rels":{}}