{"id":"fors-marsh-group-2015-2016","organization":"Fors Marsh Group","title":"Senior Software Engineer I","employment_type":"full_time","start_date":"2015-01","end_date":"2016-06","location":null,"summary":"Python application development for a NIST contract; additional application development for Veterans Administration (VA).","responsibilities":["Python application development: maintained and released a Python 3 GUI application for a password-creation research study; refactored legacy code, added automated unit tests, and stabilized the application.","Created an internal library over TKInter to simplify building new screens.","Instrumented the application for diagnostics/trace via logging to support issue investigation.","Release management: created build script, generated API documentation, and packaged the app to run without a pre-existing Python runtime.",".NET backend development (VA): created an Entity Framework data tier for an authentication store.",".NET application development (VA): enhanced a WIF single sign-on solution for self-configuration; built an HTTP/REST ASP.NET WebAPI interface and corresponding C#, JavaScript, and PHP clients.","Maintained WebForms/MS-Ajax and MVC 4 applications; created a WCF service layer and performed WCF performance tuning (serialization improvements and async via .NET 4.0 Task library).","Built a data import tool using ASP.NET, jQuery, and jQuery-UI with additional QA checks.","Front-end work: implemented HTML5 and TypeScript; requirejs module loading; converted existing JavaScript to TypeScript; implemented client-side error logging and testing data generation; contributed to Knockout.js databinding and underscore-based templates.","Created a workflow to periodically import a complex Drupal-based HTML template for reuse across ASP.NET WebForms and MVC apps.","Established an end-to-end automated TFS build customized for nUnit tests; wrote PowerShell scripts to automate build/deploy tasks."],"technologies":["Python","TKInter","PyCharm","Eclipse","IronPython","unittest","nose","sphinx","pywin","virtualenv","C#","ASP.NET","ASP.NET Web API","WIF","ASP.NET MVC","WCF","JavaScript","TypeScript","HTML5","Microsoft SQL Server","NUnit","jQuery","jQuery UI","requirejs","Knockout.js","underscore","Drupal","TFS","PowerShell",".NET Framework 4.0"],"links":[],"_links":[{"rel":"self","href":"/apis/experience/by-id/fors-marsh-group-2015-2016.json","type":"application/json"},{"rel":"collection","href":"/apis/experience/index.json","type":"application/json"},{"rel":"first","href":"/apis/experience/pages/1.json","type":"application/json"},{"rel":"describedby","href":"/apis/openapi.yaml","type":"text/yaml"}],"_rels":{}}
